# Основные команды

Большинство названий команд в radare являются производными от названий действий. Их легко запомнить, так как они короткие. На самом деле, все команды являются одиночными буквами. Подкоманды или связанные команды задаются с помощью второго символа в названии. Например, `/ foo` — это команда для поиска строки, а `/x 90 90` используется для поиска шестнадцатеричных пар.

Общий формат команды как описано в главе [Формат команды](../first_steps/command_format.md) выглядит следующим образом:

```
[.][times][cmd][~grep][@[@iter]addr!size][|>pipe] ; ...
```

Например,

```
> 3s +1024    ; ищет три раза 1024 из текущего смещения
```

Если команда начинается с `=!`, остальная часть строки передается загруженному в данный момент подключаемому модулю (например, отладчику). Большинство плагинов предоставляют инструкции при помощи `=!?` или `=!help`.

```
$ r2 -d /bin/ls
> =!help      ; обрабатывается плагином ввода-вывода
```

Если команда начинается с `!`, вызывается `posix_system()` для передачи команды в оболочку. Для получения дополнительных вариантов и примеров использования есть команда `!?`.

```
> !ls         ; запустить `ls` в операционной системе
```

Значение аргументов iter, addr, size зависит от конкретной команды. Как правило, большинство команд принимают число в качестве аргумента, чтобы указать количество байтов для работы, а не текущий размер блока. Некоторые команды принимают математические выражения или строки.

```
> px 0x17     ; показать 0x17 байт в шестнадцатеричном виде по текущему адресу,
> s base+0x33 ; установить смещение на флаг 'base' плюс 0x33 байта,
> / lib       ; искать строку 'lib'.
```

Знак `@` используется для указания временного адреса или смещения, в котором выполняется команда, вместо текущего смещения. Очень удобно, так как вам не нужно всякий раз переустанавливать смещение.

```
> p8 10 @ 0x4010  ; показать 10 байт по смещению 0x4010
> f patata @ 0x10 ; ассоциировать флаг 'patata' со смещением 0x10
```

Используя `@@`, можно выполнить одну команду над каждым элементом списка флагов, подобно glob. Можете воспринимать это как foreach:

```
> s 0
> / lib             ; поиск строки 'lib'
> p8 20 @@ hit0_*   ; показать 20 байт в шестнадцатеричном виде по каждому найденному адресу
```

Операция `>` используется для перенаправления выходных данных команды в файл (его перезаписи, если он уже существует).

```
> pr > dump.bin   ; сделать дамп 'raw'-байтов текущего блока в файл с именем 'dump.bin'
> f  > flags.txt  ; сделать дамп списка флагов в 'flags.txt'
```

Операция `|` (канал) аналогична тому, что в операционной системе *NIX: перенаправить вывод одной команды на вход для другой.

```
[0x4A13B8C0]> f | grep section | grep text
0x0805f3b0 512 section._text
0x080d24b0 512 section._text_end
```

Можно выполнить несколько команд в одной строке, разделив их точкой с запятой `;`:

```
> px ; dr
```

При помощи `_` можно распечатать результат, полученный последней командой.

```
[0x00001060]> axt 0x00002004
main 0x1181 [DATA] lea rdi, str.argv__2d_:__s
[0x00001060]> _
main 0x1181 [DATA] lea rdi, str.argv__2d_:__s
```
